#+TITLE: My Emacs Setup
#+AUTHOR: Stig Brautaset
#+OPTIONS: f:t
#+PROPERTY: header-args:              :mkdirp yes
#+PROPERTY: header-args:emacs-lisp    :tangle ~/.emacs.d/init.el :results silent
#+STARTUP: content
**** Reading mail with NotMuch

     After installing NotMuch I ran =notmuch setup= to configure it.
     Then I ran =notmuch new= to index my existing mail. (This was
     already in =~/Maildir/= since I've been using mu4e before.) You can
     also set config values independently. That is my preference now,
     as I can do everything from this file.

     #+begin_src sh :results silent
     notmuch config set database.path ~/Mail

     notmuch config set user.name "Stig Brautaset"

     notmuch config set user.primary_email "stig@brautaset.org"

     notmuch config set user.other_email 'sbrautaset@laterpay.net;stig.brautaset@icloud.com;stigbrau@start.no;stigbrau@online.no;stig.brautaset@me.com;S.Brautaset@westminster.ac.uk;Stig.Brautaset@MorganStanley.com;stig.brautaset@ktsplc.com'

     notmuch config set new.tags 'new;unread;inbox'

     notmuch config set new.ignore '.mbsyncstate;.mbsyncstate.journal;.mbsyncstate.lock;.mbsyncstate.new;.uidvalidity;.isyncuidmap.db'

     notmuch config set search.exclude_tags 'deleted;spam;draft'
     #+end_src

     We can now read the config back in, to verify our change.

     #+BEGIN_SRC sh :results output replace :exports results :tangle no
     notmuch config list
     #+END_SRC

     #+RESULTS:
     #+begin_example
     database.path=/Users/stig/Mail
     user.name=Stig Brautaset
     user.primary_email=stig@brautaset.org
     user.other_email=sbrautaset@laterpay.net;stig.brautaset@icloud.com;stigbrau@start.no;stigbrau@online.no;stig.brautaset@me.com;S.Brautaset@westminster.ac.uk;Stig.Brautaset@MorganStanley.com;stig.brautaset@ktsplc.com
     new.tags=new;unread;inbox
     new.ignore=.mbsyncstate;.mbsyncstate.journal;.mbsyncstate.lock;.mbsyncstate.new;.uidvalidity;.isyncuidmap.db
     search.exclude_tags=deleted;spam;draft
     maildir.synchronize_flags=true
     built_with.compact=true
     built_with.field_processor=true
     built_with.retry_lock=true
     #+end_example

